misc/org-usage.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-10 Sat 23:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>org 模式小记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Larry">
<link rel="stylesheet" type="text/css" href="/diary/style/style.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">org 模式小记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org211c320">Document Structure</a>
<ul>
<li><a href="#org1fd205c">outline</a></li>
<li><a href="#org42f4f7b">headlines</a></li>
<li><a href="#org528cb1d">Visibility cycling</a></li>
</ul>
</li>
<li><a href="#org6703fed">Hyperlinks</a></li>
<li><a href="#org332b3df">Markup</a>
<ul>
<li><a href="#org8f59503">title</a></li>
<li><a href="#org8c2b073">headings</a></li>
<li><a href="#org9f3783a">toc</a></li>
<li><a href="#org565874a">list</a></li>
<li><a href="#org6b4b75b">paragraphs</a></li>
<li><a href="#orga0a5aca">verbose</a></li>
<li><a href="#orgacd58db"><span class="todo TODO">TODO</span> footnote</a></li>
<li><a href="#orga9d3143">emphasis 和 monospace</a></li>
<li><a href="#org0f091fe">horizontal rules</a></li>
<li><a href="#org6af589e">comment</a></li>
</ul>
</li>
<li><a href="#org697064b">小抄</a>
<ul>
<li><a href="#org7fc2bd5"><span class="todo TODO">TODO</span> 如何跳转到下一个 <code>TODO</code></a></li>
<li><a href="#org56b149f"><span class="todo TODO">TODO</span> github org 模式支持</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div id="outline-container-org211c320" class="outline-2">
<h2 id="org211c320">Document Structure</h2>
<div class="outline-text-2" id="text-org211c320">
</div><div id="outline-container-org1fd205c" class="outline-3">
<h3 id="org1fd205c">outline</h3>
<div class="outline-text-3" id="text-org1fd205c">
<p>
Org 基于 Outline 模式，将文档以层级形式组织。可以将具体的层级折叠起来，以获得对整体结构的把握，并专注于当前处理的部分。
</p>

<p>
org 模型简化了 outline 的命令，通过 <code>org-cycle</code> （即 TAB 键）来完成主要的操作。
</p>
</div>
</div>

<div id="outline-container-org42f4f7b" class="outline-3">
<h3 id="org42f4f7b">headlines</h3>
<div class="outline-text-3" id="text-org42f4f7b">
<p>
headlines 亦即“标题”。类似于 markdown header，用多个 <code>*</code> 表示不同的级别。
</p>
</div>

<div id="outline-container-orgfe92f3e" class="outline-4">
<h4 id="orgfe92f3e">clean view</h4>
<div class="outline-text-4" id="text-orgfe92f3e">
<p>
过多的 <code>*</code> 可能造成混乱，clean view 用来解决这一问题
</p>
</div>
</div>

<div id="outline-container-org382187c" class="outline-4">
<h4 id="org382187c"><span class="todo TODO">TODO</span> 如何添加一个内部链接？</h4>
</div>
</div>
<div id="outline-container-org528cb1d" class="outline-3">
<h3 id="org528cb1d">Visibility cycling</h3>
<div class="outline-text-3" id="text-org528cb1d">
<p>
通过 <code>&lt;TAB&gt;</code> 和 <code>S-&lt;TAB&gt;</code> 来进行层级的展开（可见性控制）。Super 前缀表示对全局进行操作。
</p>

<p>
将在三个状态之间切换：
</p>

<ol class="org-ol">
<li>FOLDED（OVERVIEW）</li>
<li>CHILDREN（CONTENTS）</li>
<li>SUBTREE（SHOW ALL）</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-org6703fed" class="outline-2">
<h2 id="org6703fed">Hyperlinks</h2>
<div class="outline-text-2" id="text-org6703fed">
<dl class="org-dl">
<dt>完整写法</dt><dd><code>[[link][description]]</code></dd>
<dt>简写法</dt><dd><code>[[link]]</code></dd>
</dl>

<p>
emacs 会自动显示成最终输出的格式！但隐藏了链接地址，如果需要编辑使用 <code>C-c C-l</code> 来进行编辑
</p>
</div>
</div>

<div id="outline-container-org332b3df" class="outline-2">
<h2 id="org332b3df">Markup</h2>
<div class="outline-text-2" id="text-org332b3df">
<p>
“层次结构” 比 “排版样式” 更重要！所谓大巧不工
</p>
</div>

<div id="outline-container-org8f59503" class="outline-3">
<h3 id="org8f59503">title</h3>
<div class="outline-text-3" id="text-org8f59503">
<p>
使用 #+TITLE 来进行标记，默认使用文件名
</p>
</div>
</div>


<div id="outline-container-org8c2b073" class="outline-3">
<h3 id="org8c2b073">headings</h3>
<div class="outline-text-3" id="text-org8c2b073">
<p>
只有前三级的星级别被认为是 heading，再深的则被以 items 处理
</p>

<p>
通过 <code>headline-levels</code> 来设置（或 <code>OPTIONS</code> 参数)
</p>
</div>
</div>

<div id="outline-container-org9f3783a" class="outline-3">
<h3 id="org9f3783a">toc</h3>
<div class="outline-text-3" id="text-org9f3783a">
<p>
自动生成，与 headlines 级别一致。可定义深度，可取消。
</p>

<p>
配置参数为 
</p>

<dl class="org-dl">
<dt>级别</dt><dd><code>#+OPTIONS: toc:2</code></dd>
<dt>位置</dt><dd><code>#+TOC: headlines 2</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org565874a" class="outline-3">
<h3 id="org565874a">list</h3>
<div class="outline-text-3" id="text-org565874a">
<p>
分为三种：
</p>

<ul class="org-ul">
<li>有序</li>
<li>无序</li>
<li>描述性的列表（description list）</li>
</ul>

<p>
同一个列表应有相同的缩进。
</p>
</div>
</div>
<div id="outline-container-org6b4b75b" class="outline-3">
<h3 id="org6b4b75b">paragraphs</h3>
<div class="outline-text-3" id="text-org6b4b75b">
<p>
段落以一个空行标识。
</p>
</div>
</div>
<div id="outline-container-orga0a5aca" class="outline-3">
<h3 id="orga0a5aca">verbose</h3>
<div class="outline-text-3" id="text-orga0a5aca">
<p>
定义环境，关键字为 <code>VERSE</code> 或 <code>QUOTE</code> 或 <code>CENTER</code>
</p>
</div>
</div>
<div id="outline-container-orgacd58db" class="outline-3">
<h3 id="orgacd58db"><span class="todo TODO">TODO</span> footnote</h3>
</div>
<div id="outline-container-orga9d3143" class="outline-3">
<h3 id="orga9d3143">emphasis 和 monospace</h3>
<div class="outline-text-3" id="text-orga9d3143">
<dl class="org-dl">
<dt><code>*xx*</code></dt><dd>bold</dd>
<dt><code>/xx/</code></dt><dd>italic</dd>
<dt><code>_xx_</code></dt><dd>underlined</dd>
<dt><code>=xx=</code></dt><dd>verbatim</dd>
<dt><code>~code~</code></dt><dd>code</dd>
<dt><code>+xx+</code></dt><dd>strike</dd>
</dl>
</div>
</div>

<div id="outline-container-org0f091fe" class="outline-3">
<h3 id="org0f091fe">horizontal rules</h3>
<div class="outline-text-3" id="text-org0f091fe">
<p>
使用 5 个以上的 dash 来表示一条水平线
</p>
</div>
</div>
<div id="outline-container-org6af589e" class="outline-3">
<h3 id="org6af589e">comment</h3>
<div class="outline-text-3" id="text-org6af589e">
<ul class="org-ul">
<li>以 <code>#</code> 加空格开头，后面内容被视为注释</li>
<li>或者关键字为 COMMENT 的环境</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org697064b" class="outline-2">
<h2 id="org697064b">小抄</h2>
<div class="outline-text-2" id="text-org697064b">
</div><div id="outline-container-org7fc2bd5" class="outline-3">
<h3 id="org7fc2bd5"><span class="todo TODO">TODO</span> 如何跳转到下一个 <code>TODO</code></h3>
<div class="outline-text-3" id="text-org7fc2bd5">
<dl class="org-dl">
<dt>显示所有的 todo</dt><dd><code>C-c / t</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org56b149f" class="outline-3">
<h3 id="org56b149f"><span class="todo TODO">TODO</span> github org 模式支持</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Larry</p>
<p class="date">Created: 2017-06-10 Sat 23:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
